In [1]:
import pandas as pd
import psycopg2
from psycopg2.extensions import ISOLATION_LEVEL_AUTOCOMMIT
from sqlalchemy import create_engine
from sqlalchemy import types

Questionamento #1

Quantos itens foram vendidos no total?

In [2]:
sql = 'SELECT COUNT(units) FROM  vendas;'
engine = create_engine('postgresql://postgres:postgres@amarelo.cp6xfa6zogly.us-east-2.rds.amazonaws.com:5432/dbpy')
pd.read_sql(sql,engine)

     count
0  1260752

Questionamento #2

Quais foram as cidades fizeram mais vendas?

In [20]:
sql = 'SELECT city, units FROM geo, vendas  WHERE geo.zip = vendas.zip ORDER BY units DESC LIMIT 10 ;'
engine = create_engine('postgresql://postgres:postgres@amarelo.cp6xfa6zogly.us-east-2.rds.amazonaws.com:5432/dbpy')
pd.read_sql(sql,engine)

              city  units
0  West Sacramento     92
1            Miami     44
2            Miami     44
3        Creedmoor     40
4        Creedmoor     40
5           Normal     40
6        Nashville     36
7           Austin     33
8  West Sacramento     31
9       Rapid City     31

Questionamento #3

Qual o mês com a maior receita de vendas da Van Arsdel?

In [4]:
sql = 'SELECT vendas.revenue, vendas.date FROM vendas, produto WHERE produto.manufacturerid = 7 LIMIT 1;'
pd.read_sql(sql,engine)

   revenue        date
0  1700.37  2011-06-28

Questionamento #4

Qual a média de receita do setor por ano?

In [ ]:
sql = 'SELECT AVG(vendas.revenue) ,  produto.segment FROM vendas, produto GROUP BY  produto.segment ;'
pd.read_sql(sql,engine)

Questionamento #5

Qual o segmento mais lucrativo para a Van Arsdel?

In [4]:
sql = 'SELECT AVG(vendas.revenue) ,  produto.segment FROM vendas, produto WHERE produto.manufacturerid = 7 GROUP BY  produto.segment  LIMIT 1 ;'
pd.read_sql(sql,engine)

           avg  segment
0  5571.784354  Extreme

Questionamento #6

Dentro do segmento menos lucrativo, qual foi o produto que gerou mais receita?

In [15]:
sql = "SELECT vendas.productid ,  vendas.revenue FROM vendas, produto WHERE produto.segment = 'Select'  ORDER BY vendas.revenue DESC LIMIT 1 ;"
pd.read_sql(sql,engine)
#segment = select

   productid revenue
0       2197    None

Questionamento #7

Qual o pior concorrente da Van Arsdel? Por quê?

In [ ]:
#Mesma cidade e mesmo segmento
sql = 'SELECT produto.manufacturer FROM fabricante  WHERE produto.manufacturerid = 7 GROUP BY  produto.segment  LIMIT 1 ;'
pd.read_sql(sql,engine)

Questionamento #8

Do estado com maior número de cidade distintas, qual foi a cidade que mais fez receita?

# Espaço para pesquisar os DFs

In [ ]:
sql = 'SELECT * FROM  vendas;'
engine = create_engine('postgresql://postgres:postgres@amarelo.cp6xfa6zogly.us-east-2.rds.amazonaws.com:5432/dbpy')
pd.read_sql(sql,engine)

In [7]:
df_fabricante = pd.read_csv('fabricante.csv',',') #Importando o arquivo CSV
df_fabricante

    Unnamed: 0  manufacturerid manufacturer
0            0               6          Leo
1            1              12       Quibus
2            2               1        Abbas
3            3               2       Aliqui
4            4              14     Victoria
5            5               8       Natura
6            6               4       Currus
7            7               9        Palma
8            8              13       Salvus
9            9               5         Fama
10          10              11        Pomum
11          11              10        Pirum
12          12               3        Barba
13          13               7    VanArsdel

In [8]:
df_geo = pd.read_csv('geo.csv',',')
df_geo

         zip              city state region      district
0      15201    Pittsburgh, PA    PA   East  District #13
1      15202    Pittsburgh, PA    PA   East  District #13
2      15203    Pittsburgh, PA    PA   East  District #13
3      15204    Pittsburgh, PA    PA   East  District #13
4      15205    Pittsburgh, PA    PA   East  District #13
...      ...               ...   ...    ...           ...
39943  59933       Stryker, MT    MT   West  District #33
39944  59934         Trego, MT    MT   West  District #33
39945  59935          Troy, MT    MT   West  District #33
39946  59936  West Glacier, MT    MT   West  District #33
39947  59937     Whitefish, MT    MT   West  District #33

[39948 rows x 5 columns]

In [9]:
df_produto = pd.read_csv('produto.csv',',')
df_produto

,category,segment,product,productid,iscompetehide,manufacturerid
0,Urban,Convenience,Maximus UC-01,536,N,7
1,Urban,Convenience,Maximus UC-02,537,N,7
2,Urban,Convenience,Maximus UC-03,538,N,7
3,Urban,Convenience,Maximus UC-04,539,N,7
4,Urban,Convenience,Maximus UC-05,540,N,7
...,...,...,...,...,...,...
2407,Mix,Productivity,Quibus MP-28,1260,N,12
2408,Mix,Productivity,Quibus MP-29,1261,N,12
2409,Mix,Productivity,Quibus MP-30,1262,N,12
2410,Mix,Productivity,Quibus MP-31,1263,N,12
2411,Mix,Productivity,Quibus MP-32,1264,N,12

In [10]:
df_vendas = pd.read_csv('vendas.csv',',')
df_vendas

         productid                    date    zip  units      revenue
0               88  15/02/2000 12:00:00 AM  95605     92  $926,780.40
1             2263  12/11/2008 12:00:00 AM  33178     44  $177,380.28
2             2262  12/11/2008 12:00:00 AM  33178     44  $177,380.28
3              764  27/07/2004 12:00:00 AM  27522     40  $146,134.80
4              763  27/07/2004 12:00:00 AM  27522     40  $146,134.80
...            ...                     ...    ...    ...          ...
1260747       2213  10/02/2006 12:00:00 AM  15135      1    $1,070.37
1260748       2213  03/06/2004 12:00:00 AM  80120      1    $1,070.37
1260749       2213  27/11/2003 12:00:00 AM  30028      1    $1,070.37
1260750       2213  30/09/2006 12:00:00 AM  65279      1    $1,070.37
1260751       2213  22/06/2005 12:00:00 AM  25526      1    $1,070.37

[1260752 rows x 5 columns]

In [21]:

df2 =df_produto[df_produto["manufacturerid"] == 7]
df2

,category,segment,product,productid,iscompetehide,manufacturerid
0,Urban,Convenience,Maximus UC-01,536,N,7
1,Urban,Convenience,Maximus UC-02,537,N,7
2,Urban,Convenience,Maximus UC-03,538,N,7
3,Urban,Convenience,Maximus UC-04,539,N,7
4,Urban,Convenience,Maximus UC-05,540,N,7
...,...,...,...,...,...,...
1152,Urban,Regular,Maximus UR-01,512,N,7
1451,Rural,Select,Maximus RS-01,394,N,7
1452,Rural,Select,Maximus RS-02,395,N,7
1994,Rural,Productivity,Maximus RP-01,392,N,7
1995,Rural,Productivity,Maximus RP-02,393,N,7

In [22]:
lista = df_produto["productid"]

In [23]:
x = df_vendas["zip"][df_vendas["productid"].isin(lista)]

In [24]:
x

0          95605
1          33178
2          33178
3          27522
4          27522
           ...
1260747    15135
1260748    80120
1260749    30028
1260750    65279
1260751    25526
Name: zip, Length: 1260752, dtype: int64

In [25]:
df3 = df_geo[df_geo["zip"].isin(x)]

In [26]:
df3

         zip              city state region      district
0      15201    Pittsburgh, PA    PA   East  District #13
1      15202    Pittsburgh, PA    PA   East  District #13
2      15203    Pittsburgh, PA    PA   East  District #13
3      15204    Pittsburgh, PA    PA   East  District #13
4      15205    Pittsburgh, PA    PA   East  District #13
...      ...               ...   ...    ...           ...
39942  59932        Somers, MT    MT   West  District #33
39944  59934         Trego, MT    MT   West  District #33
39945  59935          Troy, MT    MT   West  District #33
39946  59936  West Glacier, MT    MT   West  District #33
39947  59937     Whitefish, MT    MT   West  District #33

[32595 rows x 5 columns]